# TP NoSQL

Prénom :

Nom : 

Pour ce TP noté vous avez trois heures pour le réaliser et 48 heures pour le finir si besoin. Le rendu final est attendu pour dimanche 29 septembre 2024 à 23 h 59.

Vous serrez évalués sur les requêtes mais également sur la qualité et la propreté du code. Pour chaque question, une réponse présentant les résultats est attendue.

In [2]:
# installation des packages pandas et pymongo
!pip install -r requirements.txt --quiet

In [3]:
import pymongo
import pandas as pd

URI ='mongodb+srv://user_mango:uoYZjzVGJAcGNF1E@Cluster0.glosf.mongodb.net/?retryWrites=true&w=majority&appName=Cluster0'
client = pymongo.MongoClient(URI)
db = client.tp

# output the name of the collections in the database
print("Collections: ", db.list_collection_names())

Collections:  ['restaurants', 'movies']

1. Combien de films sont dans la base de données ?

In [6]:
nb_films=db.movies.count_documents({})
nb_films

#Il y a 23530 films dans la base

23530

2. Quel est le nombre moyen de votes par pays ? Trier les pays par nombre moyen de votes décroissant.

In [9]:
vote_pays=db.movies.aggregate([
    { "$unwind" : "$countries" },
    { "$group": { "_id": "$countries", "nbvote": { "$avg": "$imdb.votes"  }}},
    { "$sort": { "nbvote": -1 }}
])

pd.DataFrame(list(vote_pays))

                      _id         nbvote
0                   Malta  210571.800000
1                 Bahamas  206061.000000
2             New Zealand   66589.269231
3    United Arab Emirates   53495.833333
4                     USA   35016.703663
..                    ...            ...
153                Kosovo     104.500000
154               Moldova     104.000000
155           North Korea      92.666667
156                Brunei      51.000000
157               Vanuatu       6.000000

[158 rows x 2 columns]

3. Donner la liste des différents genres de films.

In [12]:
genres_films=db.movies.distinct(key="genres")
pd.DataFrame(list(genres_films))
#on peut retrouver dans cette base des films de genres action , adventure, comedy etc

              0
0        Action
1     Adventure
2     Animation
3     Biography
4        Comedy
5         Crime
6   Documentary
7         Drama
8        Family
9       Fantasy
10    Film-Noir
11      History
12       Horror
13        Music
14      Musical
15      Mystery
16         News
17      Romance
18       Sci-Fi
19        Short
20        Sport
21    Talk-Show
22     Thriller
23          War
24      Western

4. Combien de films ont une note IMDb supérieure à 8 ?

In [15]:
note_sup=db.movies.count_documents({
    "imdb.rating":{"$gt":8}
})

note_sup
#Il y a 1177 films qui ont eu une note supérieur à 8

1177

5. Afficher le titre, l'année de sortie et les réalisateurs de tous les films (ne pas afficher l'ID).

In [18]:
mo=db.movies.find({},
    { "_id": 0,"title":1, "year":1,"directors":1}
)

pd.DataFrame(list(mo))

,title,directors,year
0,Intolerance: Love's Struggle Throughout the Ages,[D.W. Griffith],1916
1,The Poor Little Rich Girl,[Maurice Tourneur],1917
2,The Kid,[Charles Chaplin],1921
3,Miss Lulu Bett,[William C. de Mille],1921
4,Safety Last!,"[Fred C. Newmeyer, Sam Taylor]",1923
...,...,...,...
23525,Emelie,[Michael Thelin],2015
23526,Techo y comida,[Juan Miguel del Castillo],2015
23527,Nahid,[Ida Panahandeh],2015
23528,Coin Locker Girl,[Jun-hee Han],2015
23529,Tryapichnyy soyuz,[Mikhail Mestetskiy],2015

6. Afficher le titre et le plot des films réalisés par D.W. Griffith.

In [20]:
dw=db.movies.find(
    {"directors":"D.W. Griffith"},
    { "_id": 0,"title":1,"plot":1}
)

pd.DataFrame(list(dw))
#les films réalisés par D.W. Griffith. sont : Intolerance: Love's Struggle Throughout the Ages, A Corner in Wheat, Broken Blossoms or The Yellow Man and the Girl et "The Birth of a Nation"

,plot,title
0,"The story of a poor young woman, separated by ...",Intolerance: Love's Struggle Throughout the Ages
1,"A greedy tycoon decides, on a whim, to corner ...",A Corner in Wheat
2,"A frail waif, abused by her brutal boxer fathe...",Broken Blossoms or The Yellow Man and the Girl
3,The Civil War divides friends and destroys fam...,The Birth of a Nation

7. Quels sont les 5 acteurs les plus populaires (ceux qui ont joué dans le plus de films) ?

In [22]:
#compter le nb de film jouer par acteurs 
#trie

pop_acteurs=db.movies.aggregate([
    { "$unwind" : "$cast" },
    { "$group": { "_id": "$cast", "nbfilms": { "$sum": 1  }}},
    { "$sort": { "nbfilms": -1 }},
    {"$limit":5}
])

pd.DataFrame(list(pop_acteurs))

#les 5 acteurs les plus populaires sont : Gèrard Depardieu(68 films), Robert De Niro(60), Michael Caine(52),Marcello Mastroianni(50) et Bruce Willis (49 films)

                    _id  nbfilms
0      Gèrard Depardieu       68
1        Robert De Niro       60
2         Michael Caine       52
3  Marcello Mastroianni       50
4         Max von Sydow       49

8. Quelles sont les 6 années avec le plus de films produits ?

In [24]:
six_films=db.movies.aggregate([
    {"$sortByCount":"$year"},
    {"$limit":6}
])

pd.DataFrame(list(six_films))
#Les 6 années avec le plus de films produits sont : 2013,2014, 2012, 2011, 2009, 2010

    _id  count
0  2013   1220
1  2014   1147
2  2012   1109
3  2011   1040
4  2009    990
5  2010    970

9. Combien de films ont été réalisés avant l'année 2000 et ont une note IMDb supérieure à 7 ?

In [26]:
note=db.movies.count_documents(
    {"year":{"$lt":2000},
    "imdb.rating":{"$gt":7}}
    
)

note
#4747  films ont été réalisés avant l'année 2000  et ont une note supérieure à 7

4747

10. Donner les 20 réalisateurs qui ont réalisé le plus de films (afficher seulement leur nom et le nombre de films).

In [28]:
#compte le nb de films par réalisateurs

top_rea=db.movies.aggregate([
    {"$unwind":"$directors"},
    {"$sortByCount":"$directors"},
    {"$limit":20}
])

pd.DataFrame(list(top_rea))
#Parmis les 20 réalisateurs qui ont réalisé le plus de films on a Woody Allen, John Ford , Takashi Miike etc .

                  _id  count
0         Woody Allen     40
1           John Ford     35
2       Takashi Miike     34
3         John Huston     34
4       Werner Herzog     33
5     Martin Scorsese     32
6    Alfred Hitchcock     31
7        Sidney Lumet     30
8     Mario Monicelli     29
9       Michael Apted     29
10   Steven Spielberg     29
11       George Cukor     29
12  Steven Soderbergh     28
13          Spike Lee     28
14      Robert Altman     28
15    Jean-Luc Godard     27
16     Clint Eastwood     27
17        Wim Wenders     27
18         Johnnie To     27
19          Ken Loach     27

11. Quelle est la note IMDb moyenne des films sortis après 2010 ?

In [30]:


films_2010=db.movies.aggregate([
    {"$unwind":"$imdb"},
    {"$match":{"year":{"$gt":2010}}},
    {"$group": { "_id":"all", "note_moy": { "$avg": "$imdb.rating"}}}
    
])


pd.DataFrame(list(films_2010))
#la note moyenne  des films sortis après 2010 est d'environ 6,54

   _id  note_moy
0  all  6.544033

####12. (bonus) Afficher les films dont le titre contient le mot "love".

In [60]:
love=db.movies.aggregate([
    {"$match": {"title": {"$regex": "^love", "$options": "i"}}   },
    {"$project": { "_id": 0,  "title": 1 }}
])

pd.DataFrame(list(love))

#Voici les fims dont le titre contient 'love' :

                               title
0              Love Finds Andy Hardy
1                    Love Me Tonight
2                   Love on the Dole
3    Love Is a Many-Splendored Thing
4                Love Me or Leave Me
..                               ...
123              Love at First Fight
124                      Love Steaks
125        Love Is the Perfect Crime
126                        Lovemilla
127                             Love

[128 rows x 1 columns]

13. (bonus) Afficher le titre des films ayant un score Rotten Tomatoes (viewer) supérieur à 75.

In [66]:
f=db.movies.aggregate([
    {   "$match": {"tomatoes.viewer.meter": {"$gt": 75}}  },
    { "$project": {"_id": 0,  "title": 1  }}
])